---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ReferencePointArray
source: html/e51a2eb7-a728-0328-08a7-c28e576206b4.htm
---
# ReferencePointArray Members

Initializes a new instance of the ReferencePointArray class